#cifar10
name: "CIFAR10_all_CNN_A"

#layer {
#  name: "cifar"
#  type: "Data"
#  top: "data"
#  top: "label"
#  include {
#    phase: TRAIN
#  }
#  transform_param {
#    mean_file: "/home/mrim/dutta/caffe-cudnn/incremental_learning/models/cifar/mean.binaryproto"
#  }
#  data_param {
#    source: "/scratch/dutta/cifar10_train_lmdb"
#    batch_size: 100
#    backend: LMDB
#  }
#}
#
layer {
  name: "cifar"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "/home/mrim/dutta/caffe-cudnn/incremental_learning/models/cifar/mean.binaryproto"
  }
  image_data_param {
    source: "/scratch/dutta/cifar10_train_labels.txt"
    #source: "/scratch/dutta/cifar10_reduced_train.txt"
    root_folder: "/scratch/dutta/cifar-10-train/"
    batch_size: 100
  }
}


#layer {
#  name: "cifar"
#  type: "Data"
#  top: "data"
#  top: "label"
#  include {
#    phase: TEST
#  }
#  transform_param {
#    mean_file: "/home/mrim/dutta/caffe-cudnn/incremental_learning/models/cifar/mean.binaryproto"
#  }
#  data_param {
#    source: "/scratch/dutta/cifar10_test_lmdb"
#    batch_size: 100
#    backend: LMDB
#  }
#}
# 
#

layer {
  name: "cifar"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "/home/mrim/dutta/caffe-cudnn/incremental_learning/models/cifar/mean.binaryproto"
  }
  image_data_param {
    source: "/scratch/dutta/cifar10_test_labels.txt"
    #source: "/scratch/dutta/cifar10_reduced_val.txt"
    root_folder: "/scratch/dutta/cifar-10-test/"
    batch_size: 100
  }
}


#layer {
#  name: "drop_input"
#  type: "Dropout"
#  bottom: "data"
#  top: "drop_input"
#  dropout_param {
#    dropout_ratio: 0.2
#  }
#}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
		std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}




layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
		std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}


layer {
    bottom: "conv2"
    top: "pool1"
    name: "pool1"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
    }
}


layer {
  name: "drop1"
  type: "Dropout"
  bottom: "pool1"
  top: "pool1"
  dropout_param {
    dropout_ratio: 0.5
  }
}


layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool1"
  top: "conv3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
		std: 0.01
      
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}



layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
		std: 0.01
      
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}





















layer {
    bottom: "conv4"
    top: "pool2"
    name: "pool2"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
    }
}

layer {
  name: "drop2"
  type: "Dropout"
  bottom: "pool2"
  top: "pool2"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "pool2"
  top: "conv5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 192
    #pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
		std: 0.01
      
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer{
    name: "relu5"
    type: "ReLU"
    bottom: "conv5"
    top: "conv5"
}


layer {
  name: "conv6"
  type: "Convolution"
  bottom: "conv5"
  top: "conv6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 192
    #pad: 2
    stride: 1
    kernel_size: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer{
    name: "relu6"
    type: "ReLU"
    bottom: "conv6"
    top: "conv6"
}

layer {
  name: "conv7"
  type: "Convolution"
  bottom: "conv6"
  top: "conv7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 10
    kernel_size: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer{
    name: "relu7"
    type: "ReLU"
    bottom: "conv7"
    top: "conv7"
}

layer {
    bottom: "conv7"
    top: "pool3"
    name: "pool3"
    type: "Pooling"
    pooling_param {
        pool: AVE
        #kernel_size: 6
        global_pooling: true
    }
}

layer{
    name: "flatten"
    type: "Flatten"
    bottom: "pool3"
    top: "ip1"
}


#layer{
#  name: "ip1"
#  type: "InnerProduct"
#  bottom: "pool3"
#  top: "ip1"
#  param {
#    lr_mult: 1
#  }
#  param {
#    lr_mult: 2
#  }
#  inner_product_param {
#  num_output: 10
#
#    weight_filler {
#        type: "gaussian"
#		std: 0.01    
#      }
#  }
#}
#
#layer {
#  name: "drop3"
#  type: "Dropout"
#  bottom: "ip1"
#  top: "ip1"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip1"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip1"
  bottom: "label"
  top: "loss"
}
